#include "cheksum.h"

/*=============================================================================================================*/
/*! \brief   подсчет контрольной суммы методом исключтельного ИЛИ

    \return значение контрольной суммы
*/
/*=============================================================================================================*/
unsigned char cheksum_xorsum
(
  unsigned char previous_value,   /*!< [in] предыдущее значение контрольной суммы   */
  unsigned char *buffer,          /*!< [in] указатель на буфер с данными            */
  unsigned int  length            /*!< [in] количество байт для подсчета            */
)
{
  unsigned char temp_sum = 0;
    
  while (length-- > 0)
  {
    temp_sum ^= *buffer++;
  }
  return (temp_sum ^ previous_value);      
}

/*=============================================================================================================*/
/*! \brief   подсчет контрольной суммы методом сложения

    \return значение контрольной суммы
*/
/*=============================================================================================================*/
unsigned char cheksum_sum
(
  unsigned char *buffer,        /*!< [in] указатель на буфер с данными            */
  unsigned int  length          /*!< [in] количество байт для подсчета            */
)
{
  unsigned char temp_sum = 0;
    
  while (length-- > 0)
  {
    temp_sum += *buffer++;
  }
  return temp_sum;      
  
}

/*=============================================================================================================*/
/*! \brief  вычисление числа при сложении с которым контрольной суммы пакета дает 0

    \return значение контрольной зеро-суммы
*/
/*=============================================================================================================*/
unsigned char cheksum_zero_sum
(
  unsigned char *buffer,        /*!< [in] указатель на буфер с данными            */
  unsigned int  length          /*!< [in] количество байт для подсчета            */
)
{
    return ( 0x100 - cheksum_sum( buffer, length ) );
}

