/*=============================================================================================================*/
/*!
\file 
\brief    
\details  
*/
/*=============================================================================================================*/


#include "HAL/BSP/inc/T8_Dnepr_SMI.h"
#include "HAL\MCU\inc\T8_5282_FEC.h"
#include "Application/inc/T8_Dnepr_TaskSynchronization.h"

/*=============================================================================================================*/

static  u32 dnepr_smi_read	(u32 phy_addr, u32 reg_addr, u16* data);
static  u32 dnepr_smi_write	(u32 phy_addr, u32 reg_addr, u16 data);

/*=============================================================================================================*/

static SMI_PeriphInterfaceTypedef smi_periph_interface =
{
    dnepr_smi_read,                         /*!< указатель на функцию чтения */
    dnepr_smi_write                         /*!< указатель на функцию записи */
};

/*=============================================================================================================*/

/*=============================================================================================================*/
/*! \brief облочка для чтения регистра PHY из многозадачной среды
 *  \sa t8_m5282_fec_mdio_read, t8_dnepr_ts_smi_unlock, t8_dnepr_ts_smi_lock
 */
/*=============================================================================================================*/
static  u32 dnepr_smi_read	
(
    u32 phy_addr,           /*!< [in] адрес PHY в SMI       */    
    u32 reg_addr,           /*!< [in] адрес регистра PHY    */    
    u16 *data               /*!< [out] читаемые данные      */    
)
{
    u32 ret;
  
    t8_dnepr_ts_smi_lock();
    ret = m5282_fec_mdio_read (phy_addr, reg_addr, data);
    t8_dnepr_ts_smi_unlock();
  
    return ret;
}


/*=============================================================================================================*/
/*! \brief облочка для записи регистра PHY из многозадачной среды
 *  \sa t8_m5282_fec_mdio_write, t8_dnepr_ts_smi_unlock, t8_dnepr_ts_smi_lock
 */
/*=============================================================================================================*/
static  u32 dnepr_smi_write
(
    u32 phy_addr,           /*!< [in] адрес PHY в SMI       */    
    u32 reg_addr,           /*!< [in] адрес регистра PHY    */    
    u16 data                /*!< [in] записываемые данные   */    
)
{
    u32 ret;
  
    t8_dnepr_ts_smi_lock();
    ret = m5282_fec_mdio_write (phy_addr, reg_addr, data);
    t8_dnepr_ts_smi_unlock();
  
    return ret;
}


/*=============================================================================================================*/
/*! \brief Инициализируем декриптор интерфейса для запросившего внешнего модуля
*   \return Декриптор интерфейса SMI
*   \sa SMI_PeriphInterfaceTypedef
*/
/*=============================================================================================================*/
SMI_PeriphInterfaceTypedef *dnepr_smi_get_driver_descriptor (void)
{    
    return &smi_periph_interface;
}
