/*!
\file T8_Dnepr_TaskSynchonization.h
\brief обёртки над мьютексами для синхронизации потоков в контексте взаимодействия с spi, i2c и т. п.
\author Baranov Mikhail, <a href="mailto:baranovm@t8.ru">baranovm@t8.ru</a>
\date dec 2012
*/

//! Инициализирует мьютексы, надо вызывать после старта ОС
void T8_Dnepr_TS_Init() ;



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// защищает SPI от одновременного обращения, обращаться из верхнеуровневых
// процедур (драйвер ПЛИС, BPEEPROM и  пр.) из соображений эффективности

void T8_Dnepr_TS_SPI_Lock() ;
void T8_Dnepr_TS_SPI_Unlock() ;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// защищает I2C, вызывать из интерфейсных функций ()

void T8_Dnepr_TS_I2C_Lock() ;
void T8_Dnepr_TS_I2C_Unlock() ;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// защищает файловую систему, вызывается из функций yaffsfs_Lock и yaffsfs_Unlock

void T8_Dnepr_TS_FFS_Lock() ;
void T8_Dnepr_TS_FFS_Unlock() ;
